import streamlit as st

import pandas as pd
import numpy as np
st.markdown(
    """
   <div style="direction: rtl;">
    <h1 style="font-weight: bold;">كيف تتاجر في السيارات المستعملة</h1>
                <p>كما نعلم أن السيارات في السعودية تعد الشريان الرئيسي الوحيد للنقل العام في السعودية لأسباب كثيرة، ومن ضمنها طبيعة المناخ في المملكة وعدم وجود وسائل نقل بديلة مثل القطارات والباصات، رغم ظهورها في بعض المناطق الرئيسية الا انها تحتاج وقت طويل حتى يتمكن المجتمع الاعتماد علياه، ولذلك حتى الان فإن السيارة امر لا غنى عنه  فلا تكاد تجد بيت سعودي لا توجد فيه سيارتان على الاقل،ونظرا لضخامة حجم سوق السيارات في المملكة فإن سوق السيارات المستعملة يعتبر جزءا كبيرا منه، ويرى البعض ان هناك فرصة كبيرة لدخول سوق السيارات المستعملة والتجارة فيه، ونحن هنا في هذا الصدد سوف نستعرض طبيعة هذا السوق والفرص المتواجدة فيه، وسوف نعتمد في تحليلنا على بيانات منصة الكترونية لبيع السيارات المستعملة وهي منصة "سيارة" وتتضمن البيانات ما يقارب 5700 سيارة
</p>

    </div>
    """,
    unsafe_allow_html=True
)


# Using HTML and CSS to set text direction to right-to-left
st.markdown(
    """
    <div style="direction: rtl;">
        <h2>توزيع السيارات المستعملة في المملكة العربية السعودية </h2>
                <p >اول سؤال يمكن ان يطرح ويأخذ بعين الاعتبار قبل البدء بأي خطوة هو، ماهي المناطق التي توجد فيها اكبر اسواق السيارات المستعملة، نلاحظ بحسب هذا الرسم ان الثلاث المدن الرئيسية "جدة والرياض والدمام" يمثلون قرابة ٧٠ بالمئة من حجم السوق ولهذا فإن الفرص فيها اكبر من غيرها ولكن قد تكون اسواق هذه المناطق اكثر نضجا وأشد تنافسية ولذلك قد يصعب الدخول فيها، وفي المقابل قد تكون منطقة القصيم بحكم انها الرابعة حجما فإنها قد تكون خيارا ممتازا لكونها واعدة بالنمو والتنافسية فيها ليست عالية …. صورة
</p>

    </div>
    """,
    unsafe_allow_html=True
)
st.image("image1.png")
#-----------------------------------------------------------------------

# Using HTML and CSS to set text direction to right-to-left
st.markdown(
    """
    <div style="direction: rtl;">
        <h2> القدرة على التفاوض على السعر</h2>
             <p >لا بد من التنبه الى أن طبيعة سوق السيارات المستعملة مختلف عن السيارات الجديدة، فإن سوق السيارات المستعملة يعتمد كثيرا على المزاد والتفاوض او ما نسميه "على السوم" ونلاحظ ان نسبة البيع بهذه الطريقة تشكل ما يقارب ثلث عمليات البيع والشراء ككل، وهذا الامر يتطلب مهارات جيدة في التفاوض ومتابعة مستمرة للسوق لانتهاز الفرص  …صورة  
</p>
    </div>
    """,
    unsafe_allow_html=True
)
st.image("image2.png")
#-----------------------------------------------------------------------

# Using HTML and CSS to set text direction to right-to-left
st.markdown(
    """
    <div style="direction: rtl;">
        <h2> أعلى 5 علامات تجارية </h2>
                <p>والان لنأخذ نظرة عن السيارات الاكثر طلبا في السوق، نلاحظ ان هناك خمس شركات سيارات مهيمنة، سواء على مستوى السوق بأكمله او على مستوى كل منطقة، والأسلم لمن يود الدخول في هذا السوق ان يبدأ التجارة بهذه السيارات بحكم ان الطلب عليها عالي وبالتالي المخاطرة فيها اقل … صورة
</p>

    </div>
    """,
    unsafe_allow_html=True
)
st.image("image3.png")
#-----------------------------------------------------------------------

# Using HTML and CSS to set text direction to right-to-left
st.markdown(
    """
    <div style="direction: rtl;">
        <h2>أفضل 5 علامات تجارية في الرياض/</h2>
        
    </div>
    """,
    unsafe_allow_html=True
)
st.image("image4.png")
#-----------------------------------------------------------------------

# Using HTML and CSS to set text direction to right-to-left
st.markdown(
    """
    <div style="direction: rtl;">
        <h2> أفضل 5 علامات تجارية في الدمام</h2>
        
    </div>
    """,
    unsafe_allow_html=True
)
st.image("image5.png")
#-----------------------------------------------------------------------

# Using HTML and CSS to set text direction to right-to-left
st.markdown(
    """
    <div style="direction: rtl;">
        <h2> أفضل 5 علامات تجارية في جدة</h2>
        
    </div>
    """,
    unsafe_allow_html=True
)
st.image("image6.png")
#-----------------------------------------------------------------------

# Using HTML and CSS to set text direction to right-to-left
st.markdown(
    """
    <div style="direction: rtl;">
        <h2> أفضل 5 علامات تجارية في القصيم</h2>
        
    </div>
    """,
    unsafe_allow_html=True
)
st.image("image7.png")


